service/src/test/resources/ws-samplexml/managePostPayTariff20_getContract_paym_no4g.xml

<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:cor="http://soa.o2.co.uk/coredata_1" 
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" 
    xmlns:mtd="http://soa.o2.co.uk/managepostpaytariffdata_2"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xsi:schemaLocation="http://soa.o2.co.uk/managepostpaytariffdata_2 managepostpaytariffdata_2_0.xsd http://soa.o2.co.uk/pscommonpostpaydata_1 pscommonpostpaydata_1_0.xsd http://soa.o2.co.uk/coredata_1 coredata_1_1.xsd ">
    <soapenv:Header>
        <wsse:Security>
            <wsse:UsernameToken>
                <wsse:Username>musicQubed_1001</wsse:Username>
                <wsse:Password>XXX</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
        <cor:SOAConsumerTransactionID>201306261618:musicqubed.london.test</cor:SOAConsumerTransactionID>
    </soapenv:Header>
    <soapenv:Body>
        <mtd:getContract>
            <mtd:customerId>
                <cor:msisdn>447709408222</cor:msisdn>
            </mtd:customerId>
        </mtd:getContract>
    </soapenv:Body>
</soapenv:Envelope>